Repository: Nikityyy/kalorat
Catalog: lib/l10n/app_*.arb
Languages: de

# welcome
source: Welcome to Kalorat
de: Willkommen bei Kalorat

# welcomeSubtitle
source: Your companion for the climb.
de: Dein Begleiter am Berg.

source: Next
de: Weiter

source: Back
de: Zurück

source: Done
de: Fertig

source: Cancel
de: Abbrechen

source: Save
de: Speichern

source: Delete
de: Löschen

source: Edit
de: Bearbeiten

source: Yes
de: Ja

source: No
de: Nein

# onboardingName
source: What's your name?
de: Wie heißt du?

# onboardingNameHint
source: Your name
de: Dein Name

# onboardingBirthdate
source: When were you born?
de: Wann bist du geboren?

# onboardingHeight
source: How tall are you?
de: Wie groß bist du?

# onboardingHeightHint
source: Height in cm
de: Größe in cm

# onboardingWeight
source: How much do you weigh?
de: Wie viel wiegst du?

# onboardingWeightHint
source: Weight in kg
de: Gewicht in kg

# onboardingLanguage
source: Select language
de: Sprache auswählen

# onboardingApiKey
source: Enter Gemini API key
de: Gemini API-Key eingeben

# onboardingApiKeyInfo
source: Enter your API key from ai.dev. Go to https://ai.dev → Account → Create API Key → paste here.
de: API-Key von ai.dev eintragen. Gehe zu https://ai.dev → Konto → API Key erstellen → hier einfügen.

source: Home
de: Start

source: Me
de: Ich

source: History
de: Historie

source: Settings
de: Einstellungen

source: Profile
de: Profil

source: Age
de: Alter

source: years
de: Jahre

source: Height
de: Größe

source: Weight
de: Gewicht

# bmiUnderweight
source: Underweight
de: Untergewicht

# bmiNormal
source: Normal weight
de: Normalgewicht

# bmiOverweight
source: Overweight
de: Übergewicht

# bmiObese
source: Obese
de: Adipositas

# takePhoto
source: Capture
de: Foto aufnehmen

source: Add more photos
de: Weitere Fotos hinzufügen

# analyzeMeal
source: Check Provisions
de: Mahlzeit checken

# analyzing
source: Checking...
de: Prüfe...

# mealName
source: Meal
de: Mahlzeit

# calories
source: Energy
de: Kalorien

source: Protein
de: Eiweiß

# carbs
source: Carbohydrates
de: Kohlenhydrate

# fats
source: Fat
de: Fett

source: Vitamins
de: Vitamine

source: Minerals
de: Mineralstoffe

source: Manual entry
de: Manuell eingeben

# offlineMessage
source: You are offline. The AI will analyze your meal once you are back online and open the app.
de: Du bist offline. Die AI wird die Mahlzeit analysieren, sobald du wieder online bist und die App öffnest.

# pendingAnalysis
source: Pending analyses
de: Ausstehende Analysen

# processingQueue
source: Processing pending meals...
de: Verarbeite ausstehende Mahlzeiten...

source: Today
de: Heute

source: This week
de: Diese Woche

source: This month
de: Dieser Monat

source: This year
de: Dieses Jahr

source: Day
de: Tag

source: Week
de: Woche

source: Month
de: Monat

source: Year
de: Jahr

source: Total
de: Gesamt

source: Weight tracking
de: Gewichtsverlauf

source: Add weight
de: Gewicht eintragen

source: Weight history
de: Gewichtsverlauf

# noWeightData
source: The path starts here.
de: Der Weg beginnt hier.

source: Statistics
de: Statistiken

# noMealData
source: No meals recorded yet
de: Noch keine Mahlzeiten erfasst

source: meals logged
de: Mahlzeiten erfasst

source: Language
de: Sprache

# apiKeyInfo
source: Enter or change your API key from ai.dev.
de: API-Key von ai.dev eintragen oder ändern.

source: Export data
de: Daten exportieren

source: Import data
de: Daten importieren

# exportSuccess
source: Data exported successfully
de: Daten erfolgreich exportiert

# importSuccess
source: Data imported successfully
de: Daten erfolgreich importiert

# importError
source: Error importing data
de: Fehler beim Importieren

source: Notifications
de: Benachrichtigungen

source: Meal reminders
de: Mahlzeit-Erinnerungen

source: Weight reminders
de: Gewichts-Erinnerungen

source: Confirm delete?
de: Wirklich löschen?

# confirmDeleteMeal
source: Do you really want to delete this meal?
de: Möchtest du diese Mahlzeit wirklich löschen?

# cameraPermission
source: Camera permission required
de: Kamera-Berechtigung wird benötigt

source: Grant permission
de: Berechtigung erteilen

source: Start Onboarding
de: Onboarding starten

# meTitle
source: Profile
de: Profil

source: Delete weight?
de: Gewicht löschen?

# deleteWeightConfirm
source: Do you really want to delete this entry?
de: Möchtest du diesen Eintrag wirklich löschen?

source: Height (cm)
de: Größe (cm)

source: Weight (kg)
de: Gewicht (kg)

source: Birthdate
de: Geburtsdatum

source: {age} years
de: {age} Jahre

source: Save changes
de: Änderungen speichern

source: Saved
de: Gespeichert

source: Data
de: Daten

# exported
source: Exported: {path}
de: Exportiert: {path}

source: Import successful
de: Import erfolgreich

source: Import failed
de: Import fehlgeschlagen

# buildingPlan
source: Building your plan...
de: Wir erstellen deinen Plan...

# analyzingMetabolism
source: Analyzing your metabolism
de: Dein Stoffwechsel wird analysiert

# apiKeyValidationError
source: Please enter a valid API key
de: Bitte einen gültigen API-Key eingeben

# analysisError
source: Analysis error: {error}
de: Fehler bei der Analyse: {error}

source: Meal saved
de: Mahlzeit gespeichert

source: Log your weight
de: Gewicht eintragen

# weightReminderBody
source: Don't forget to track your weight today!
de: Vergiss nicht, dein Gewicht heute einzutragen.

# mealReminderTitle
source: Time to eat!
de: Zeit zum Essen

# mealReminderBody
source: Remember to log your meal.
de: Denk daran, deine Mahlzeit zu erfassen.

source: How old are you?
de: Wie alt bist du?

source: What's your goal?
de: Was ist dein Ziel?

# loseWeight
source: Healthy Pace
de: Gesundes Tempo

# maintainWeight
source: Steady Path
de: Pfad halten

# gainMuscle
source: Building Strength
de: Kraft aufbauen

source: What's your gender?
de: Was ist dein Geschlecht?

source: Male
de: Männlich

source: Female
de: Weiblich

source: Other
de: Divers

source: YOUR BMI
de: DEIN BMI

source: Weight Progress
de: Gewichtsverlauf

source: CALORIES CONSUMED
de: KALORIEN AUFGENOMMEN

# proteinShort
source: Prot
de: Eiw.

# carbsShort
source: Carb
de: KH

# fatsShort
source: Fat
de: Fett

# reminders
source: Nudges
de: Impulse

source: Log meals
de: Mahlzeiten loggen

# logMealsSubtitle
source: Morning, Lunch, Dinner
de: Morgens, Mittags, Abends

source: Log weight
de: Gewicht loggen

# logWeightSubtitle
source: Daily reminder
de: Tägliche Erinnerung

source: No data available
de: Keine Daten verfügbar

source: Recent History
de: Verlauf der letzten Tage

# noFoodDetected
source: No food detected. Please try again.
de: Kein Essen erkannt. Bitte versuche es erneut.

source: My History
de: Meine Historie

# noMealsRecorded
source: Your journal is empty.
de: Dein Journal ist leer.

# deleteQuestion
source: Delete?
de: Löschen?

# deleteMealConfirmation
source: Do you really want to delete this meal?
de: Möchtest du diese Mahlzeit wirklich löschen?

# analyzingMeal
source: Checking provisions...
de: Mahlzeit wird geprüft...

# cameraNeeded
source: Camera Access Needed
de: Kamera benötigt

# cameraPermissionText
source: To analyze your meals, Kalorat needs access to your camera.
de: Damit Kalorat deine Mahlzeiten analysieren kann, benötigen wir Zugriff auf deine Kamera.

source: Back to selection
de: Zurück zur Auswahl

source: Review Photos
de: Fotos überprüfen

source: Discard
de: Verwerfen

# addPhoto
source: + Photo
de: + Foto

source: Start Analysis
de: Analyse starten

source: Analysis Result
de: Analyse Ergebnis

# saveMeal
source: Log Entry
de: Eintrag loggen

# welcomeSlogan
source: Calories, tracked beautifully.
de: Kalorien, schön getrackt.

source: Get Started
de: Los geht's

# genderLabel
source: Gender
de: Geschlecht

# goalLabel
source: Goal
de: Ziel

# chooseGender
source: Choose your gender
de: Welches Geschlecht hast du?

# calculateMetabolicRate
source: To calculate your metabolic rate.
de: Um deinen Grundumsatz zu berechnen.

# continueButton
source: Continue
de: Weiter

source: What is your goal?
de: Was ist dein Ziel?

# burnFatSubtitle
source: Burn fat & get lean
de: Fett verbrennen

# maintainSubtitle
source: Stay healthy & fit
de: Gesund & fit bleiben

# buildMassSubtitle
source: Build mass & strength
de: Masse & Stärke

source: Create Plan
de: Plan erstellen

# aiConfigure
source: Configure AI
de: AI Konfigurieren

source: Go to
de: Gehe zu

# createKeyInstruction
source: and create a free key. Copy it, paste it here, and start tracking.
de: und erstelle einen kostenlosen Key. Kopiere ihn, füge ihn hier ein und tracke deine Kalorien.

# enterApiKeyError
source: Please enter an API Key
de: Bitte gib einen API-Key ein

# invalidApiKeyError
source: Invalid API Key. Please check your input.
de: Ungültiger API-Key. Bitte überprüfe deine Eingabe.

# validateAndContinue
source: Validate & Continue
de: Validieren & Weiter

# nameSubtitle
source: We'd like to know how to call you.
de: Wir möchten dich persönlich ansprechen.

source: Weight saved!
de: Gewicht gespeichert!

# goalWeightLoss
source: Weight Loss
de: Gewicht verlieren

# goalMaintainWeight
source: Maintain Weight
de: Gewicht halten

# goalMuscleGain
source: Muscle Gain
de: Muskeln aufbauen

source: Edit meal name
de: Mahlzeitnamen bearbeiten

source: Edit calories
de: Kalorien bearbeiten

source: Date
de: Datum

source: Health Integration
de: Gesundheitsintegration

# healthSyncEnabled
source: Sync with Health
de: Mit Gesundheit synchronisieren

# healthSyncDescription
source: Share nutrition and weight data with Apple Health or Google Health Connect.
de: Teile Ernährungs- und Gewichtsdaten mit Apple Health oder Google Health Connect.

# connectHealth
source: Connect
de: Verbinden

# disconnectHealth
source: Disconnect
de: Trennen

source: Sync meals
de: Mahlzeiten synchronisieren

source: Sync weight
de: Gewicht synchronisieren

# healthConnected
source: Connected
de: Verbunden

# healthNotConnected
source: Not connected
de: Nicht verbunden

# healthConnectNotInstalled
source: Health Connect app not installed
de: Health Connect App nicht installiert

# healthPermissionDenied
source: Health permissions denied
de: Gesundheitsberechtigungen verweigert

# healthSyncSuccess
source: Synced with health app
de: Mit Gesundheits-App synchronisiert

# healthOnboardingTitle
source: Connect Your Health
de: Gesundheit verbinden

# healthOnboardingDescription
source: Sync your nutrition and weight data with your device's health app for a complete picture of your wellness.
de: Synchronisiere deine Ernährungs- und Gewichtsdaten mit der Gesundheits-App deines Geräts für einen vollständigen Überblick.

# healthOnboardingBenefit1
source: Automatic meal logging
de: Automatisches Mahlzeiten-Logging

# healthOnboardingBenefit2
source: Weight sync across apps
de: Gewicht über Apps synchronisieren

# healthOnboardingBenefit3
source: Unified health dashboard
de: Einheitliches Gesundheits-Dashboard

source: Connect Now
de: Jetzt verbinden

source: Skip for now
de: Später einrichten

# syncWith
source: Sync with {appName}
de: Mit {appName} synchronisieren

source: Connected
de: Verbunden

source: Disconnected
de: Getrennt

# healthConnectionFailed
source: Connection failed
de: Verbindung fehlgeschlagen

# loginTitle
source: Sign In
de: Anmelden

# loginSubtitle
source: Sync your data across all your devices
de: Synchronisiere deine Daten auf all deinen Geräten

source: Sign in with Google
de: Mit Google anmelden

source: Continue as guest
de: Als Gast fortfahren

# guestWarning
source: Guest data is only stored locally and cannot be recovered if you switch devices.
de: Gastdaten werden nur lokal gespeichert und können nicht wiederhergestellt werden, wenn du das Gerät wechselst.

source: Account
de: Konto

# loggedInAs
source: Signed in as {email}
de: Angemeldet als {email}

# logOut
source: Sign Out
de: Abmelden

source: Delete Account
de: Konto löschen

# deleteAccountConfirm
source: Are you sure? All your data will be permanently deleted.
de: Bist du sicher? Alle deine Daten werden unwiderruflich gelöscht.

# requestData
source: Request My Data
de: Meine Daten anfordern

source: Guest Mode
de: Gastmodus

# loginToSync
source: Sign in to sync your data
de: Anmelden um Daten zu synchronisieren

source: Sync complete
de: Synchronisierung abgeschlossen

source: Account deleted
de: Konto gelöscht

source: Data exported
de: Daten exportiert

# accountSection
source: Your data is stored locally only
de: Deine Daten werden nur lokal gespeichert

source: Settings saved
de: Einstellungen gespeichert

# logOutConfirm
source: Are you sure you want to log out?
de: Möchtest du dich wirklich abmelden?

# loggedOut
source: Logged out successfully
de: Erfolgreich abgemeldet

source: Error
de: Fehler

# rateLimitMeals
source: The Guide says: Rest a bit, you've tracked enough for today.
de: Der Guide sagt: Ruh dich etwas aus, du hast heute genug getrackt.

# rateLimitPhotos
source: The Guide says: Pack light. 5 photos are enough.
de: Der Guide sagt: Pack leicht. 5 Fotos genügen.

source: Legal
de: Rechtliches

source: Privacy Policy
de: Datenschutzerklärung

source: Terms of Service
de: Nutzungsbedingungen

# featureOnlyInApp
source: Only in app
de: Nur in der App

# healthNotAvailableWeb
source: Health integration requires the native app
de: Die Gesundheitsintegration erfordert die native App

source: Activity Level
de: Aktivitätslevel

source: Sedentary
de: Sitzend

source: Lightly Active
de: Leicht aktiv

source: Moderately Active
de: Moderat aktiv

# activeLevel
source: Active
de: Aktiv

source: Very Active
de: Sehr aktiv

# activityLevelSubtitle
source: To calculate your calorie needs.
de: Für die Berechnung deines Kalorienbedarfs.

# sedentarySubtitle
source: Desk job, little movement
de: Büroarbeit, wenig Bewegung

# lightlyActiveSubtitle
source: Light activity, 1-3x per week
de: Leichte Aktivität, 1-3x pro Woche

# moderatelyActiveSubtitle
source: Exercise 3-5x per week
de: Sport 3-5x pro Woche

# activeSubtitle
source: Exercise 6-7x per week
de: Sport 6-7x pro Woche

# veryActiveSubtitle
source: Heavy physical labor
de: Schwere körperliche Arbeit

# dailyAvg
source: ø / day
de: ø / Tag

source: Streak
de: Serie

# streakDays
source: {count} days
de: {count} Tage

source: Discard photos?
de: Fotos verwerfen?

# discardPhotosConfirm
source: Your captured photos will be lost.
de: Deine aufgenommenen Fotos gehen verloren.

source: Select date
de: Datum wählen

# cameraNotAvailableWeb
source: Camera is not available in the browser.
de: Kamera im Browser nicht verfügbar.

# useGalleryInstead
source: Use the gallery button below to pick photos.
de: Nutze die Galerie unten, um Fotos auszuwählen.
